{
   "books": [
       {
           "title": "Life",
           "image": "elllo.png",
           "chapters": [
               {
                   "title": "Life in India",
                   "audio": "LifeInIndia.mp3",
                   "text": "Todd: Hello, Nitya.\n\nNitiya: Hi\n\nTodd: How are you today?\n\nNitiya: Great.\n\nTodd: Now, Nitya, can you talk a little a bit about where are you from?\n\nNitiya: OK, I'm from India, the Northern part of India, and from a very small city, but the oldest one in India. It's considered a very religious and holy city. It has a lot of temples and mosque and different things.\n\nTodd: Wow, that's cool. What is your city's name?\n\nNitiya: Varanasi\n\nTodd: Varanasi.\n\nNitiya: Yep.\n\nTodd: And how do you spell Varanasi in English?\n\nNitiya: Varanasi.\n\nTodd: That's a cool name. Varanasi. And it's the oldest city...\n\nNitiya: The oldest city in India.\n\nTodd: Now you said it's a holy city. What kind of holy city? For what religion?\n\nNitiya: Because that's the greatest part, that it has all the religions, buildings there are like mosques for muslims and it has temples and it has (gan) temples, different kind of, and buddhist temples. (Wow) It has a place where Buddha gave his first lecture (seriously) in the world, yeah, it's called Saranat. You ask any buddhist people and they know about it.Nitiya: Because that's the greatest part, that it has all the religions, buildings there are like mosques for muslims and it has temples and it has (gan) temples, different kind of, and buddhist temples. (Wow) It has a place where Buddha gave his first lecture (seriously) in the world, yeah, it's called Saranat. You ask any buddhist people and they know about it.\n\nTodd: Saranat\\n\nNitiya: Yeah, Buddha gave his first lecture sitting under a tree, and the tree's been preserved there for ages.\n\n Todd: Man, that's incredible. Wow, now are you buddhist?\n\nNitiya: NO.\n\nTodd: Oh, what religion are you?\n\nNitiya: I'm hindu.\n\nTodd: Hindu, OK, and there's hindu temples naturally. (Yeah) OK, so what is the difference between say, a buddhist temple, in architecture, and a hindu temple, do they look the same?\n\nNitiya: Not exactly because Buddhist temple, OK, it has Buddha basically, right, (right) Hindu temples have like 33,000 gods so you go in different temples and you find different, like different sculptures sitting there so it's...\n\n Todd: Are there really 33,000 gods?\n\nNitiya: There are really! There are 33,000 gods, but I think I know maybe not even 50 of them.\n\nTodd: Oh, really.\n\nNitiya: But, come on, it's basically just God.\n\nTodd: Right, right.\n\nTodd: Saranat\n\nNitiya: Yeah, Buddha gave his first lecture sitting under a tree, and the tree's been preserved there for ages.\n\nTodd: Man, that's incredible. Wow, now are you buddhist?\n\nNitiya: NO.\n\nTodd: Oh, what religion are you?\n\nNitiya: I'm hindu.\n\nTodd: Hindu, OK, and there's hindu temples naturally. (Yeah) OK, so what is the difference between say, a buddhist temple, in architecture, and a hindu temple, do they look the same?\n\nNitiya: Not exactly because Buddhist temple, OK, it has Buddha basically, right, (right) Hindu temples have like 33,000 gods so you go in different temples and you find different, like different sculptures sitting there so it's...\n\nTodd: Are there really 33,000 gods?\n\nNitiya: There are really! There are 33,000 gods, but I think I know maybe not even 50 of them.\n\nTodd: Oh, really.\n\nNitiya: But, come on, it's basically just God.\n\nTodd: Right, right.\n\nNitiya: You just see them in different forms. That's it so.\n\nTodd: Oh, OK, well of the different forms, which is a more popular one? Which is a very common one?\n\nNitiya: I think Shiva because they say he's the, he created the earth so\n\nTodd: Shiva.\n\nNitiya: Yeah, Shiva.\n\nTodd: Wow, interesting. OK, and is your town, is it big, is it small, is it medium-sized?\n\nNitiya: I think, it's like medium, not very big, not very small.\n\nTodd: OK, so sounds like a good place. Do you see yourself living there forever when you get older?\n\nNitiya: I wish but I don't think so, I don't think that I will be there, for my life?\n\nTodd: Oh, why.\n\nNitiya: Because if I think about my career right now I prefer being in Japan for at least five years, and even if I go back it would be some other city or bigger city where I'd be working because my place ... we don't have the job opportunities so much, because it's not even a manufacturing area or industrialized area. I don't think so.\n\nTodd: OK, thanks."
               },
               {
                   "title": "Life in the Arctic",
                   "audio": "LifeInTheArctic.mp3",
                   "text": "Todd: So, Abidemi, you were talking about living with the Inuits in Northern Canada. What were some things that they do differently, like for example food or games or traditions?\n\nAbidemi: Food was a big thing that was different there. They eat a lot of meat, I could say, if I can say that from the sea, so because they're surrounded by the sea, they have access to a lot of food from there. They eat beluga, seal, whales. Anything that's found in the sea I think they basically eat it, and they eat just about all the parts of the animal, so that was quite interesting.\n\nTodd: That's so interesting. What does it taste like, seal and whale?\n\nAbidemi: Very ...?\n\nTodd: Is it cooked?\n\nAbidemi: Sometimes they cook it, yeah. They also freeze it. They have different ways of preparing it. Sometimes to do eat it raw. They say that is the best way to eat it to get the most amount of energy from it, and sometimes they freeze it, and they eat it frozen. They eat a lot of fish, frozen fish like that. Attic char - delicious, and sometimes they boil it, but I don't think that's their preferred method of eating it. One thing to note is that the younger generation, they seem to prefer more the meat - beef - and the meat that more of everybody eats now, whereas the older generation, of course, they still prefer their traditional way of cooking and eating. Also, they eat caribou, like land animals, caribou, rabbit and one or two other animals that I can't remember.\n\nTodd: Now did you try all these foods?\n\nAbidemi: I tried as many as I could. I love eating, and if everyone else is eating it, I'll eat it too, so I try them all. I have my, the ones I like more, but I didn't find anything disgusting. I enjoyed it.\n\nTodd: That's so cool. Did you learn how to prepare it or cook some of it?\n\nAbidemi: No. I'm laughing because I'm not a huge cook anywhere, so I just do the eating and cleaning up\n\nTodd: Yeah, OK cool. You mentioned that they played some games. They have their own style of games. Do you remember any games that they play?\n\nAbidemi: They have games, where one was like wrestling. They have a lot of body contact games where they would wrestle on the ground, or you had to hold up your leg a certain way for how many minutes, just really games that had to deal with strength and endurance is what I would say, and then they played a lot of games using dice where you would win prizes. I think a lot of these things were designed for the long winter months, so they could stay indoors and still keep themselves entertained, and because in those days, in the past they didn't have TV or have the kind of entertainment, Internet, which they do have there now, so they have a lot of games that they still try to play sometimes to keep them entertained.\n\nAnd music is a large part of their life too. A lot of people play different instruments and they square dance. They're really good dancers. They can dance all night, so that was fun as well.\n\nTodd: Oh wow, sounds like a great place.\n\nAbidemi: Yes, it was.\n\nTodd: So do they have their own type of instruments? Their own traditional instruments?\n\nAbidemi: I would say no. The instruments that I saw were more things that had been brought up to them, for example the fiddle, guitar, stuff like that. Thinking back on it now, maybe there were one or two things that they had made, but I didn't feel like, I can't really remember the name. I didn't really remember the names, so.\n\nTodd: Nice, anyway, thanks for sharing.\n\nAbidemi: My pleasure."
               },
               {
                   "title": "Life in Miami",
                   "audio": "LifeInMiami.mp3",
                   "text": "Todd: So, hello, Alexandra.\n\nAlexandra: Hi, how are you?\n\nTodd: I'm doing good. Now Alexandra, you're from Miami.\n\nAlexandra: Yes, I am.\n\nTodd: OK, so why don't you tell us about Miami.\n\nAlexandra: Born and raised in Miami, and it's very warm, very warm. Lots of different people. It seems to be the port of Central and South America, so there's several different people from different countries coming through, as well as from Europe and some parts of the North of the United States come down for a visit and it's a tourist destination.\n\nTodd: Wow, were you born in Miami?\n\nAlexandra: Yes\n\nTodd: Really!\n\nAlexandra: Yes, I was.\n\nTodd: And you lived your whole life there?\n\nAlexandra: Yep, yeah, yeah.\n\nTodd: That's cool, what's the best thing about Miami?\n\nAlexandra: The weather obviously, weather and the nearness to the ocean. Everything you can think of that can be done on the ocean, you can find a way to do it there.\n\nTodd: Oh, nice, so what water sports do you play?Alexandra: There's water volleyball, and do some skiing, and diving, and also during season you can go and catch lobster down in the keys.\n\nReally\n\nAlexandra: Yes, so it can be fun.\n\nTodd: That's so cool. So you catch the lobster and eat it that night?\n\nAlexandra: Yes. Yes. Absolutely. So you just go get the lobster out of the traps, take the upstairs to the boat, so to speak, and just throw them in a pot, and you're gonna have dinner in no time.\n\nTodd: You don't eat them on the boat do you?\n\nAlexandra: You can.\n\nTodd: Really! People eat the lobsters on the boat?\n\nAlexandra: Yeah, you can.\n\nTodd: Wow. Are they dangerous? I mean, cause they can snip your fingers.\n\nAlexandra: Well, you don't, you make sure you catch them in the right, hold them from the tail end and people usually put rubberbands around the claws, and you can just throw them into boiling water, get your butter out and you're good to go."
               },
               {
                   "title": "Student Life in China Part 1",
                   "audio": "StudentLifeInChinaPart1.mp3",
                   "text": "Todd: Rufei, you are from China. In America, Chinese students have a reputation of being very hard-working. Is that true?\n\nRufei: Yes, exactly. In my high school, in one class we have around 70 students in one class and everybody wants to be the top student, so everybody works so hard. I say my high school was kind of like a prison. You have to go to school every day from 6:35 AM to 9:40 PM.\n\nTodd: Really? That long?\n\nRufei: Yes.\n\nTodd: That's over 12 hours; that's like 13, 14 hours a day!\n\nRufei: Yes, exactly.\n\nTodd: How did you feel as a student studying that much?\n\nRufei: Sleepy.\n\nTodd: I bet.\n\nRufei: Every day I'm so sleepy.\n\nTodd: I can imagine. Do you think it was productive studying that much?\n\nRufei: I think their purpose just like as to stay as much time as we can in the school and we cannot get distracted by other stuff, so we always stay at school and we always focus on our studying ... We cannot know anything about the outside of the wall from school.\n\nTodd: That's amazing. For such a long day, can you talk about the daily schedule? What was your schedule like everyday?\n\nRufei: From 6:50, we start to have class. From 6:50 until maybe 11:45; we have 45 minutes class and then 10 minutes break. We also have 30 minutes we have to do exercise on the playground and, in the afternoon, is the same routine. Then, we went to dinner around 6:00 to 7:00. From 7:00 to 9:40 we have to do our homework.\n\nTodd: So, you study at school? It's not homework, it's school work; you don't actually go home, right?\n\nRufei: Yeah.\n\nTodd: That's crazy. How many classes would you have every day?\n\nRufei: Eight classes.\n\nTodd: What were the subjects?\n\nRufei: We separate the subject. If you learn more Mathematics, we learn mathematics, English, and Chinese, and physics, chemistry, and biology.\n\nTodd: That's very rigorous. Did you enjoy all the subjects?\n\nRufei: Yeah. I love physics and biology and chemistry.\n\nTodd: Now you are training to be a doctor?\n\nRufei: Yeah.\n\nTodd: That's fantastic. Did you know you wanted to be a doctor when you were in high school?\n\nRufei: I kind of know because my father is a doctor and he was kind of forcing me to study medicine.\n\nTodd: Nice. We have a phrase in English; we say, \"Follow in your father's footsteps.\" You definitely are following in your father's footsteps. That's great. Is your mother a doctor?\n\nRufei: My mother is a businesswoman now.\n\nTodd: Okay, great. You had all these courses. In America, there's a big controversy about tests, that the kids take too many tests; it's too test driven. What about in China? Do you have a lot of tests?\n\nRufei: Yeah, I have test every month. They will make a list of every single person; how much score you got in this test-\n\nTodd: Whoa. They rank everybody to see-\n\nRufei: Yes.\n\nTodd: That's very competitive.\n\nRufei: Yeah. I think that's kind of bad for our emotion.\n\nTodd: Yeah, so it creates a lot of stress.\n\nRufei: Yeah. We have 2000 students in one grade.\n\nTodd: That is crazy. So, you can be number 2000, you can be the lowest student?\n\nRufei: Yes.\n\nTodd: And they put that out there?\n\nRufei: Yes.\n\nTodd: Really? They could never do that in America.\n\nRufei: Yeah, I think so.\n\nTodd: Oh my gosh. Do you think that's a good idea?\n\nRufei: Depends on the person.\n\nTodd: Right; yeah. Wow. You have a lot of pressure. Did you feel pressure from your parents, from your peers, from your teachers?\n\nRufei: Yeah.\n\nTodd: Who gave you the most pressure?\n\nRufei: Myself.\n\nTodd: That's good.\n\nRufei: I don't want to be lazy. I don't want to be worse, so I have to always work hard to chasing other people ... Everybody wants to be the best, so everybody worked really, really hard. Even we have breaking time, they don't break at all.\n\nTodd: Seriously?\n\nRufei: Yes.\n\nTodd: What do they do during the break?\n\nRufei: They do questions.\n\nTodd: Wow. They quiz each other? The students quiz each other or they just do homework?\n\nRufei: They do their homework and they find out what problem they've had and they solve the problem with teachers or other students. They just starting all day; they can't do that.\n\nTodd: That's amazing. Kids do this 14, 15 hours a day?\n\nRufei: Yeah.\n\nTodd: Wow. That's really good for China!\n\nRufei: We don't have that much summer vacation and winter vacation. In winter vacation, we have two weeks because of the Chinese New Year; it's about two weeks off. We have two weeks in winter vacation and one week summer vacation only.\n\nTodd: Is that enough?\n\nRufei: Of course not. Even we have vacation, the teacher would give us a lot of homework to do.\n\nTodd: That is very impressive.\n\nRufei: This is very not good experience.\n\nTodd: We'll talk about that in the next interview; I think that's a very interesting point."
               },
               {
                   "title": "Student Life in China Part 2",
                   "audio": "StudentLifeInChinaPart2.mp3",
                   "text": "Todd: Rufei, you said that your education system is very strict and you study like 15 hours a day.\n\nRufei: Yes.\n\nTodd: Okay so, if you were in charge would you keep the system the same way?\n\nRufei: It depends on the person. I think there should be a place that's as strict as my high school. You can choose to send your children to go there or if the students themselves, they want to go to that school, they can go. I think that's really, really motivative to student's to study hard because everybody do the same and they are trying their best to be the best.\n\nTodd: Wow. Yeah we have a phrase in English like, \"A rising tide lifts all boats\", and I think it's kind of the same. So if it's really rigorous for most people, it's gonna pull everybody up.\n\nRufei: Yes.\n\nTodd: Rufei, you said that your education system is very strict and you study like 15 hours a day.\n\nRufei: Yes.\n\nTodd: Okay so, if you were in charge would you keep the system the same way?\n\nRufei: It depends on the person. I think there should be a place that's as strict as my high school. You can choose to send your children to go there or if the students themselves, they want to go to that school, they can go. I think that's really, really motivative to student's to study hard because everybody do the same and they are trying their best to be the best.\n\nTodd: Wow. Yeah we have a phrase in English like, \"A rising tide lifts all boats\", and I think it's kind of the same. So if it's really rigorous for most people, it's gonna pull everybody up.\n\nRufei: Yes.\n\nTodd: Okay. There's nothing you would change? Like if you were in charge would you give maybe a little more vacation time? Would you start the day later? Would you make classes smaller?\n\nRufei: If I can choose I will definitely don't choose my school because that was horrible for me because I need a lot of sleep than normal people, but I cannot have that much time to sleep. So I always sleep on the class, and when somebody found out that I am sleeping on the class they will decrease the score of my class.\n\nTodd: Oh, that's serious.\n\nRufei: Yes, very serious. Yeah, your teacher would punish you to write a paper like, \"I am sorry I decreased the score of our class, I shouldn't sleep on the class\", and I have to write it for like an hour to write that stuff.\n\nTodd: That is very harsh.\n\nRufei: Yeah.\n\nTodd: I think though a lot of people, when they hear stories like that they actually are a little bit envious, especially parents or teachers. Because in the rest of the world it's not that, students don't try that hard.\n\nRufei: Yeah.\n\nTodd: So that's kind of special, actually.\n\nRufei: Yeah, I think that's the special point of China.\n\nTodd: Wow. So, what time did you have to get up every day to get to school at 6:45?\n\nRufei: I have to get up at 6:00.\n\nTodd: Oh, well that was not too bad. That's pretty fast, you wake up at 6:00, you get to school by 6:45.\n\nRufei: Yeah, I can wear my clothes pretty fast and directly get on my father's car and eat on my father's car and put my socks on, on my father's car.\n\nTodd: Wow! Talk about streamlined, very mobile. That's great. What about the tests? It's really controversial in the US about standardized tests. Rather than just learning, the students often have to prepare for tests. In your country is there also a big movement just to have a lot of testing?\n\nRufei: We have a test each month, and we only do paper tests. The questions can be really difficult, yeah always very, very difficult. In my case, I'm in the middle ...\n\nTodd: Middle of the pack, as we say.\n\nRufei: Yeah, the middle of the pack. For mathematics, we have totally 150 scores and probably I can get 60 to 70.\n\nTodd: Wow, that's a big range. Do some students get 100%?\n\nRufei: No.\n\nTodd: No?\n\nRufei: If you get more than 120, you are really brilliant. So the question's always really, really difficult.\n\nTodd: Can the teacher get 150?\n\nRufei: I'm not sure.\n\nTodd: Well I have to admit, because even English teachers will tell you, and they're lying if they don't admit this, even on tests like the TOEFL, it's very hard for a teacher to get 100%. Not because of knowledge, but because of concentration.\n\nRufei: Yes.\n\nTodd: Right?\n\nRufei: Exactly. We have a lot of questions and some of them, they are kind of tricky.\n\nTodd: Right.\n\nRufei: Yeah.\n\nTodd: So they mislead you a little bit.\n\nRufei: Yeah.\n\nTodd: Oh no, that's great. So you took all these courses, what was the course you were best at and the course you were worst at?\n\nRufei: English was my worst at.\n\nTodd: Oh no, your English is wonderful! Really?\n\nRufei: Yeah.\n\nTodd: Oh I disagree.\n\nRufei: It was.\n\nTodd: Oh, OK. How do you learn English in China?\n\nRufei: Actually, my speaking skills I gathered from my traveling, I did solo traveling last year.\n\nTodd: Wow, you've learned a lot, quickly.\n\nRufei: Thank you.\n\nTodd: That's great! That's really inspirational I think for a lot of the students that listen to this site. One year?\n\nRufei: Yeah.\n\nTodd: Fantastic.\n\nRufei: But the thing I have to mention about is, you have to know a lot of words. Before you start to speak English, you have to know what you know. Like you have to remember a lot of words, and then you can use it when you have to use it.\n\nTodd: Okay, right. So English was tough, not easy.\n\nRufei: Not easy, for everything you have to learn. Learning isn't easy and funny stuff for everyone. Starting is hard and it's kind of betray the human ...\n\nTodd: Spirit?\n\nRufei: Yes.\n\nTodd: Wow, that's crazy. So how many students would be in an English class? I hear that China has huge English classes. Like there might be 100 students in one class.\n\nRufei: It can be, but it depends. In my high school we have the same class at the same classroom always, and in my university we have 30 students in my English.\n\nTodd: Oh okay, that's kind of normal. That's still a lot, for an English teacher that's a lot. Were your teachers usually Chinese, or an international teacher?\n\nRufei: Chinese teacher.\n\nTodd: Chinese teacher, okay. And so there was a big stress on grammar and vocabulary, things like that?\n\nRufei: Yes.\n\nTodd: How about listening?\n\nRufei: We only do the audio listening test. So it's always the same pronunciation.\n\nTodd: Yeah, so you don't have a lot of variety of accents?\n\nRufei: Yes.\n\nTodd: Yeah. Okay, well you have to introduce ELLO to China, the website.\n\nRufei: Yeah, cool.\n\nTodd: What was your best subject?\n\nRufei: My best subject was mathematics.\n\nTodd: Oh great. Yeah, that's impressive. I have a degree in economics and there's a lot of math. I went to a good school but I was not strong at math and I was terrible at physics. And physics and economics are kind of related, but not really, I did not do very well in physics. So how are you at physics?\n\nRufei: Actually I love all the math stuff, but also included physics, because you also have to use a lot of mathematics on your physics. For the physics you have to know the formula very well, then you can use it. If you don't know the formula very well, when the question is there you cannot ...\n\nTodd: Apply?\n\nRufei: ... apply that.\n\nTodd: Yeah. Oh yeah, I agree, it's tough. I am very impressed with you because whenever I meet somebody who is good at math or physics, I have great admiration. My degree was math heavy, but math was not my strong point.\n\nRufei: So what was your strong point?\n\nTodd: That's a good question. I was never a good student at anything. How I got to a good university is actually surprising, but I was always middle of the road. Middle of the pack, as we said. Always B- student, in everything.\n\nRufei: I see.\n\nTodd: Yeah, I was not exceptional like you.\n\nRufei: You don't have to be very good at starting, but you can handle your life very easily. That's also an important thing for a human.\n\nTodd: That is true, I do agree with that. But I think if I was a student in China, I would be that Mister 2000.\n\nRufei: Yes.\n\nTodd: Okay. There's nothing you would change? Like if you were in charge would you give maybe a little more vacation time? Would you start the day later? Would you make classes smaller?\n\nRufei: If I can choose I will definitely don't choose my school because that was horrible for me because I need a lot of sleep than normal people, but I cannot have that much time to sleep. So I always sleep on the class, and when somebody found out that I am sleeping on the class they will decrease the score of my class.\n\nTodd: Oh, that's serious.\n\nRufei: Yes, very serious. Yeah, your teacher would punish you to write a paper like, \"I am sorry I decreased the score of our class, I shouldn't sleep on the class\", and I have to write it for like an hour to write that stuff.\n\nTodd: That is very harsh.\n\nRufei: Yeah.\n\nTodd: I think though a lot of people, when they hear stories like that they actually are a little bit envious, especially parents or teachers. Because in the rest of the world it's not that, students don't try that hard.\n\nRufei: Yeah.\n\nTodd: So that's kind of special, actually.\n\nRufei: Yeah, I think that's the special point of China.\n\nTodd: Wow. So, what time did you have to get up every day to get to school at 6:45?\n\nRufei: I have to get up at 6:00.\n\nTodd: Oh, well that was not too bad. That's pretty fast, you wake up at 6:00, you get to school by 6:45.\n\nRufei: Yeah, I can wear my clothes pretty fast and directly get on my father's car and eat on my father's car and put my socks on, on my father's car.\n\nTodd: Wow! Talk about streamlined, very mobile. That's great. What about the tests? It's really controversial in the US about standardized tests. Rather than just learning, the students often have to prepare for tests. In your country is there also a big movement just to have a lot of testing?\n\nRufei: We have a test each month, and we only do paper tests. The questions can be really difficult, yeah always very, very difficult. In my case, I'm in the middle ...\n\nTodd: Middle of the pack, as we say.\n\nRufei: Yeah, the middle of the pack. For mathematics, we have totally 150 scores and probably I can get 60 to 70.\n\nTodd: Wow, that's a big range. Do some students get 100%?\n\nRufei: No.\n\nTodd: No?\n\nRufei: If you get more than 120, you are really brilliant. So the question's always really, really difficult.\n\nTodd: Can the teacher get 150?\n\nRufei: I'm not sure.\n\nTodd: Well I have to admit, because even English teachers will tell you, and they're lying if they don't admit this, even on tests like the TOEFL, it's very hard for a teacher to get 100%. Not because of knowledge, but because of concentration.\n\nRufei: Yes.\n\nTodd: Right?\n\nRufei: Exactly. We have a lot of questions and some of them, they are kind of tricky.\n\nTodd: Right.\n\nRufei: Yeah.\n\nTodd: So they mislead you a little bit.\n\nRufei: Yeah.\n\nTodd: Oh no, that's great. So you took all these courses, what was the course you were best at and the course you were worst at?\n\nRufei: English was my worst at.\n\nTodd: Oh no, your English is wonderful! Really?\n\nRufei: Yeah.\n\nTodd: Oh I disagree.\n\nRufei: It was.\n\nTodd: Oh, OK. How do you learn English in China?\n\nRufei: Actually, my speaking skills I gathered from my traveling, I did solo traveling last year.\n\nTodd: Wow, you've learned a lot, quickly.\n\nRufei: Thank you.\n\nTodd: That's great! That's really inspirational I think for a lot of the students that listen to this site. One year?\n\nRufei: Yeah.\n\nTodd: Fantastic.\n\nRufei: But the thing I have to mention about is, you have to know a lot of words. Before you start to speak English, you have to know what you know. Like you have to remember a lot of words, and then you can use it when you have to use it.\n\nTodd: Okay, right. So English was tough, not easy.\n\nRufei: Not easy, for everything you have to learn. Learning isn't easy and funny stuff for everyone. Starting is hard and it's kind of betray the human ...\n\nTodd: Spirit?\n\nRufei: Yes.\n\nTodd: Wow, that's crazy. So how many students would be in an English class? I hear that China has huge English classes. Like there might be 100 students in one class.\n\nRufei: It can be, but it depends. In my high school we have the same class at the same classroom always, and in my university we have 30 students in my English.\n\nTodd: Oh okay, that's kind of normal. That's still a lot, for an English teacher that's a lot. Were your teachers usually Chinese, or an international teacher?\n\nRufei: Chinese teacher.\n\nTodd: Chinese teacher, okay. And so there was a big stress on grammar and vocabulary, things like that?\n\nRufei: Yes.\n\nTodd: How about listening?\n\nRufei: We only do the audio listening test. So it's always the same pronunciation.\n\nTodd: Yeah, so you don't have a lot of variety of accents?\n\nRufei: Yes.\n\nTodd: Yeah. Okay, well you have to introduce ELLO to China, the website.\n\nRufei: Yeah, cool.\n\nTodd: What was your best subject?\n\nRufei: My best subject was mathematics.\n\nTodd: Oh great. Yeah, that's impressive. I have a degree in economics and there's a lot of math. I went to a good school but I was not strong at math and I was terrible at physics. And physics and economics are kind of related, but not really, I did not do very well in physics. So how are you at physics?\n\nRufei: Actually I love all the math stuff, but also included physics, because you also have to use a lot of mathematics on your physics. For the physics you have to know the formula very well, then you can use it. If you don't know the formula very well, when the question is there you cannot ...\n\nTodd: Apply?\n\nRufei: ... apply that.\n\nTodd: Yeah. Oh yeah, I agree, it's tough. I am very impressed with you because whenever I meet somebody who is good at math or physics, I have great admiration. My degree was math heavy, but math was not my strong point.\n\nRufei: So what was your strong point?\n\nTodd: That's a good question. I was never a good student at anything. How I got to a good university is actually surprising, but I was always middle of the road. Middle of the pack, as we said. Always B- student, in everything.\n\nRufei: I see.\n\nTodd: Yeah, I was not exceptional like you.\n\nRufei: You don't have to be very good at starting, but you can handle your life very easily. That's also an important thing for a human.\n\nTodd: That is true, I do agree with that. But I think if I was a student in China, I would be that Mister 2000."
               }
           ]
       }
   ]
}
